feat: iterate spec, epic and hu skills
